# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [1]:
import pandas as pd
import numpy as np

# Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [3]:
temp=pd.read_csv('Temp_States.csv')

#### Print `temp`.

In [4]:
temp

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [5]:
temp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   City         7 non-null      object
 1   State        7 non-null      object
 2   Temperature  7 non-null      float64
dtypes: float64(1), object(2)
memory usage: 296.0+ bytes

In [ ]:
"""
Type of the City and State is object
"""

In [6]:
temp.dtypes

City            object
State           object
Temperature    float64
dtype: object

#### Select the rows where state is New York.

In [7]:
temp.loc[temp.State =='New York']

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [9]:
np.mean(temp.loc[temp.State =='New York'].Temperature)

10.74074074074074

#### Which states and cities have a temperature above 15 degrees Celsius?

In [13]:
temp.loc[temp.Temperature>=15]

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [14]:
temp.City.loc[temp.Temperature>=15]

0         NYC
3    Hartford
5      Treton
6      Newark
Name: City, dtype: object

In [15]:
temp.loc[temp.Temperature>=15].City

0         NYC
3    Hartford
5      Treton
6      Newark
Name: City, dtype: object

In [16]:
temp['City'].loc[temp.Temperature>=15]

0         NYC
3    Hartford
5      Treton
6      Newark
Name: City, dtype: object

In [17]:
temp.loc[temp.Temperature>=15]['City']

0         NYC
3    Hartford
5      Treton
6      Newark
Name: City, dtype: object

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [22]:
temp.City.loc[(temp.Temperature>=15) & (temp.Temperature<=20)]

0         NYC
3    Hartford
6      Newark
Name: City, dtype: object

#### Find the mean and standard deviation of the temperature of each state.

In [24]:
temp.groupby('State').mean()

             Temperature
State
Connecticut    15.833333
New Jersey     21.111111
New York       10.740741

In [25]:
temp.groupby('State').std()

             Temperature
State
Connecticut     1.964186
New Jersey      1.571348
New York        8.133404

In [31]:
temp.groupby('State')['Temperature'].agg(['mean', 'std'])

                  mean       std
State
Connecticut  15.833333  1.964186
New Jersey   21.111111  1.571348
New York     10.740741  8.133404

#  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [33]:
employees=pd.read_csv('employees.csv')
employees

    Department Education      Title      Name  Years  Salary
0        Admin    Master  associate     David      4      58
1           IT    Master  associate    Thomas      7      45
2        Admin    Master  associate     Diana     10      52
3        Admin    Master         VP  Manuella     15      33
4        Sales    Master    Analyst     Carla      6      38
..         ...       ...        ...       ...    ...     ...
495      Sales       PhD         VP    Calvin      2     119
496         HR    Master    Analyst    Dustin      6      67
497      Sales       PhD         VP   Winston     13      93
498         IT       PhD    Analyst      Earl     12     108
499      Sales    Master    Analyst     Alvin     13      48

[500 rows x 6 columns]

#### Explore the data types of the `employees` dataframe. Comment your results.

In [34]:
employees.dtypes

Department    object
Education     object
Title         object
Name          object
Years          int64
Salary         int64
dtype: object

In [35]:
"""
Type of Years is int64 and Salary is int64, normally, its should be years and float
"""

'\nType of Years is int64 and Salary is int64\n'

#### What's the average salary in this company?

In [36]:
employees.Salary.mean()

73.528

#### What's the highest salary?

In [37]:
employees.Salary.max()

120

#### What's the lowest salary?

In [38]:
employees.Salary.min()

30

#### Who are the employees with the lowest salary?

In [41]:
employees.Name[employees.Salary==employees.Salary.min()]

27         Sean
106        Luke
128        Adam
139        Rick
214        Neil
266      Marcel
452    Augustin
Name: Name, dtype: object

#### Find all the information about an employee called David.

In [42]:
employees[employees.Name=='David']

    Department Education      Title   Name  Years  Salary
0        Admin    Master  associate  David      4      58
124         IT  Bachelor         VP  David      3      31

#### Could you return only David's salary?

In [43]:
employees[employees.Name=='David'].Salary

0      58
124    31
Name: Salary, dtype: int64

#### Print all the rows where job title is associate.

In [44]:
employees[employees.Title=='associate']

    Department Education      Title      Name  Years  Salary
0        Admin    Master  associate     David      4      58
1           IT    Master  associate    Thomas      7      45
2        Admin    Master  associate     Diana     10      52
7           HR    Master  associate     Carol     14      53
8        Admin       PhD  associate      Jean      8      50
..         ...       ...        ...       ...    ...     ...
477         HR       PhD  associate   Phillip     11     113
486         IT  Bachelor  associate       Jay     14      58
487         HR    Master  associate  Patricia     10     110
491      Admin       PhD  associate     Alice      8      37
494      Sales  Bachelor  associate   Vanessa     11     118

[158 rows x 6 columns]

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [45]:
# Method 1
employees.head(3)

  Department Education      Title    Name  Years  Salary
0      Admin    Master  associate   David      4      58
1         IT    Master  associate  Thomas      7      45
2      Admin    Master  associate   Diana     10      52

In [46]:
# Method 2
print(employees.iloc[:3])

  Department Education      Title    Name  Years  Salary
0      Admin    Master  associate   David      4      58
1         IT    Master  associate  Thomas      7      45
2      Admin    Master  associate   Diana     10      52

#### Find the employees whose title is associate and whose salary is above 55.

In [48]:
employees[(employees.Title=='associate') & (employees.Salary >= 55)]

    Department Education      Title      Name  Years  Salary
0        Admin    Master  associate     David      4      58
9        Admin    Master  associate    Kareem      3     104
10       Admin    Master  associate   Cynthia      1     114
16       Admin  Bachelor  associate    Shanon      1      99
18       Admin  Bachelor  associate     Megan      9      79
..         ...       ...        ...       ...    ...     ...
476      Admin       PhD  associate      Greg      8      93
477         HR       PhD  associate   Phillip     11     113
486         IT  Bachelor  associate       Jay     14      58
487         HR    Master  associate  Patricia     10     110
494      Sales  Bachelor  associate   Vanessa     11     118

[104 rows x 6 columns]

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [54]:
employees.groupby(by='Years').mean('Salary')

          Salary
Years
1      75.863636
2      75.857143
3      74.571429
4      77.129032
5      73.857143
6      72.382353
7      73.840000
8      64.250000
9      76.741935
10     73.351351
11     74.866667
12     73.454545
13     71.935484
14     70.968750
15     69.758621

####  What is the average salary per title?

In [57]:
employees.groupby('Title')['Salary'].mean()

Title
Analyst      73.703911
VP           72.907975
associate    73.968354
Name: Salary, dtype: float64

In [58]:
employees.groupby('Title')['Salary'].agg({'mean'})

                mean
Title
Analyst    73.703911
VP         72.907975
associate  73.968354

####  Find the salary quartiles.

In [61]:
employees.Salary.quantile([0.25, 0.5, 0.75])

0.25    50.0
0.50    72.0
0.75    97.0
Name: Salary, dtype: float64

#### Is the mean salary different per gender?

In [63]:
'''
There isn't the gender in this dataset
'''

"\nThere isn't the gender in this dataset\n"

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [64]:
employees.groupby('Department').agg({'min','mean','max'})

C:\Users\lehai\AppData\Local\Temp\ipykernel_16360\457503766.py:1: FutureWarning: ['Education', 'Title', 'Name'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  employees.groupby('Department').agg({'min','mean','max'})

           Years               Salary
             min max      mean    min  max       mean
Department
Admin          1  15  7.642276     30  120  76.325203
HR             1  15  7.172131     30  119  74.237705
IT             1  15  8.141791     30  120  70.671642
Sales          1  15  7.206612     30  120  73.132231

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [70]:
employees.groupby('Department')['Salary'].apply(lambda x: x.max() - x.min())

Department
Admin    90
HR       89
IT       90
Sales    90
Name: Salary, dtype: int64

# Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [68]:
orders=pd.read_csv('Orders.csv',index_col=0)
orders

,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 8:26:00,2.55,17850,United Kingdom,15.30
1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 8:26:00,3.39,17850,United Kingdom,20.34
2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 8:26:00,2.75,17850,United Kingdom,22.00
3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 8:26:00,3.39,17850,United Kingdom,20.34
4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 8:26:00,3.39,17850,United Kingdom,20.34
...,...,...,...,...,...,...,...,...,...,...,...,...,...
541904,581587,22613,2011,12,5,12,pack of 20 spaceboy napkins,12,2011-12-09 12:50:00,0.85,12680,France,10.20
541905,581587,22899,2011,12,5,12,children's apron dolly girl,6,2011-12-09 12:50:00,2.10,12680,France,12.60
541906,581587,23254,2011,12,5,12,childrens cutlery dolly girl,4,2011-12-09 12:50:00,4.15,12680,France,16.60
541907,581587,23255,2011,12,5,12,childrens cutlery circus parade,4,2011-12-09 12:50:00,4.15,12680,France,16.60
541908,581587,22138,2011,12,5,12,baking set 9 piece retrospot,3,2011-12-09 12:50:00,4.95,12680,France,14.85

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [69]:
orders.describe()

,InvoiceNo,year,month,day,hour,Quantity,UnitPrice,CustomerID,amount_spent
count,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000
mean,560617.126645,2010.934259,7.612537,3.614555,12.728247,13.021823,3.116174,15294.315171,22.394749
std,13106.167695,0.247829,3.416527,1.928274,2.273535,180.420210,22.096788,1713.169877,309.055588
min,536365.000000,2010.000000,1.000000,1.000000,6.000000,1.000000,0.000000,12346.000000,0.000000
25%,549234.000000,2011.000000,5.000000,2.000000,11.000000,2.000000,1.250000,13969.000000,4.680000
50%,561893.000000,2011.000000,8.000000,3.000000,13.000000,6.000000,1.950000,15159.000000,11.800000
75%,572090.000000,2011.000000,11.000000,5.000000,14.000000,12.000000,3.750000,16795.000000,19.800000
max,581587.000000,2011.000000,12.000000,7.000000,20.000000,80995.000000,8142.750000,18287.000000,168469.600000

In [ ]:
"""
your comments here
"""

####  What is the average purchase price?

In [73]:
orders['UnitPrice'].mean()

3.116174480549152

#### What are the highest and lowest purchase prices?

In [74]:
orders['UnitPrice'].agg({'min','max'})

min       0.00
max    8142.75
Name: UnitPrice, dtype: float64

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [75]:
orders.loc[orders['Country']=='Spain']['CustomerID']

6421      12557
6422      12557
6423      12557
6424      12557
6425      12557
          ...
535271    17097
535272    17097
535273    17097
535274    17097
535275    17097
Name: CustomerID, Length: 2485, dtype: int64

In [85]:
orders[orders.Country=='Spain'][['CustomerID']]. groupby('CustomerID').count()

Empty DataFrame
Columns: []
Index: [12354, 12417, 12421, 12442, 12445, 12448, 12450, 12454, 12455, 12462, 12484, 12502, 12507, 12510, 12538, 12539, 12540, 12541, 12544, 12545, 12546, 12547, 12548, 12550, 12551, 12556, 12557, 12596, 12597, 17097]

#### How many customers do we have in Spain?

In [86]:
len(orders[orders.Country=='Spain'][['CustomerID']]. groupby('CustomerID').count())

30

In [88]:
len(orders.loc[orders['Country']=='Spain']['CustomerID'].drop_duplicates())

30

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [112]:
df1=orders.groupby('CustomerID')['Quantity'].agg({'count'})

            count
CustomerID
12346           1
12347         182
12348          31
12349          73
12350          17
...           ...
18280          10
18281           7
18282          12
18283         756
18287          70

[4339 rows x 1 columns]

In [114]:
df1.loc[df1['count']>=50]

            count
CustomerID
12347         182
12349          73
12352          85
12354          58
12356          59
...           ...
18260         134
18263          61
18272         166
18283         756
18287          70

[1931 rows x 1 columns]

#### Select orders from Spain that include more than 50 items.

In [117]:
df2 = orders.groupby('InvoiceNo')['Quantity'].agg('sum').to_frame()
df2.loc[df2['Quantity']>50]

           Quantity
InvoiceNo
536367           83
536370          449
536371           80
536373           88
536375           88
...             ...
581583           76
581584          120
581585          278
581586           66
581587          105

[15426 rows x 1 columns]

#### Select all free orders.

In [122]:
df3 = orders.groupby('InvoiceNo')['amount_spent'].agg({'sum'})
df3.loc[df3['sum']==0]

           sum
InvoiceNo
543599     0.0
564651     0.0
568384     0.0
578841     0.0

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [ ]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [ ]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your code here

#### Select all orders made in the month of August.

In [ ]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [ ]:
# your code here

#### What's the  average amount of money spent by country?

In [ ]:
# your code here

#### What's the most expensive item?

In [ ]:
# your code here

#### What is the average amount spent per year?

In [ ]:
# your code here